Revit 2026 API

# LoadCaseNumber Property

---

Returns unique load case number.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Number { get; set; }
```
```vb
Public Property Number As Integer
	Get
	Set
```
```cpp
public:
property int Number {
	int get ();
	void set (int value);
}
```
```fsharp
member Number : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given number is not unique. |

#### Reference

LoadCase Class

Autodesk.Revit.DB.Structure Namespace